# -*- coding:utf-8 -*-
'''
log api example: log('output is: ' + str(output))
'''
from scipy.stats import norm, chi2

from log_api import log
import numpy as np


class Solution():
    def solve(self):
        old_people = [250084, 162233, 928642, 414649, 275828, 672227, 349177, 468616, 345592, 1247962, 759091, 853195,
                      420377, 504043, 1400109, 1196924, 779566, 939818, 957360, 616828, 93525, 488115, 1412294, 446686,
                      514563, 20828, 487378, 338325, 51945, 61207, 201515]
        total_people = [1849475, 1127589, 7037620, 3477805, 2310941, 4252076, 2551123, 3465051, 2253525, 7577122,
                        5400348, 5312628, 3477491, 4251692, 9272503, 9224288, 5226904, 6096586, 9676589, 4362551,
                        826560, 2609882, 8161604, 3332265, 4467537, 265904, 3614887, 2623094, 535412, 611957, 2086576]
        n = len(total_people)
        old_rate = [old_people[i] * 100.0 / total_people[i] for i in range(0, n)]
        mean = np.mean(old_rate)
        sd = np.std(old_rate)
        mean_delta = sd / np.sqrt(n) * norm.ppf(0.95)
        sqd_lower = (n - 1) * (sd ** 2) / chi2.ppf(1 - 0.05, n - 1)
        sqd_upper = (n - 1) * (sd ** 2) / chi2.ppf(0.05, n - 1)
        return [[mean - mean_delta, mean + mean_delta], [sqd_lower, sqd_upper]]


'''
人口普查是一项重要的国情调查，对于国家管理、制定各项方针政策具有重要的意义，中国最早的一次人口普查在西汉汉平帝元始二年进行，而自中华人民共和国建国以来分别在1953、1964、1982、1990、2000和2010年进行了共六次人口普查，其中第六次人口普查分别涉及到了人口增长、家庭户人口、性别构成、年龄构成、民族构成、受教育程度、城乡人口、人口流动性等八方面。现有《各地区分性别、健康状况的60岁及以上老年人口》调查数据、《各地区户数、人口数和性别比》调查数据，定义老龄率=60岁及以上人口数*100/总人口数，以北京市为例，其老龄率为250084*100/1849475=13.52，请编写python代码回答如下问题：

以各省市数据为代表，求取中国省级老龄率均值的置信区间、方差的置信区间，置信水平均为90%，假设老龄率符合正态分布

Output Example

[[mean_lower, mean_upper], [variance_lower, variance_upper]]

Output Description

[[均值下限，均值上限],[方差下限，方差上限]]，均为浮点数
'''
log(Solution().solve())
